/**************************************************//*
	@file	| Entity.cpp
	@brief	| エンティティ基底クラス
	@note	| エンティティの共通処理を定義
			| CGameObjectを継承
*//**************************************************/
#include "Entity.h"

/****************************************//* 
	@brief　	| コンストラクタ
*//****************************************/
CEntity::CEntity()
	:CGameObject()
	, m_f3Velocity({ 0.0f, 0.0f, 0.0f })
{
}

/****************************************//* 
	@brief　	| デストラクタ
*//****************************************/
CEntity::~CEntity()
{
}